app/views/companydescriptions/_description.html.erb

  <% allfield = Allfield.find(description.allfield_id) %>
---
SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1