app/views/ideas/add_comment.js.erb

newAuthor.className = "author";
newAuthor.innerHTML = "by <%= @idea.first_name %> <%= @idea.last_name %> on <%= @idea.created_at.strftime('%m/%d/%Y') %>";
---
INSERT INTO `ideas` (`companydescription_id`, `content`, `created_at`, `first_name`, `idea_id`, `is_protected`, `last_name`, `startup_id`, `title`, `updated_at`, `user_id`) VALUES (241, 'submit', '2013-11-26 07:31:00', 'Kon', 266, 0, 'Pon', 30, 'Topics', '2013-11-26 07:31:00', 2)