app/views/ideas/create.js.erb

INSERT INTO `ideas` (`companydescription_id`, `content`, `created_at`, `first_name`, `idea_id`, `is_protected`, `last_name`, `startup_id`, `title`, `updated_at`, `user_id`) VALUES (82, 'jhgk,hg', '2013-11-21 19:23:48', 'Sergey', NULL, 0, 'Astretsov', 11, 'Prototype', '2013-11-21 19:23:48', 1)
---
newP.innerHTML = '<h2><%= simple_format @idea.title %></h2><%= simple_format h @idea.content.gsub(/\r\n?/, '\n') %>';
ideaDiv.insertBefore(newP, formNode);