app/views/ideas/show_replies.js.erb

SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`idea_id` = 248
---
for (var i = 0; i < notes.length; i++) {
    if (notes[i].getAttribute('name') == 'idea[title]'){notes[i].value = '<%= @idea.title %>'}