app/views/ideas/show_idea.js.erb

        newP.innerHTML = '<%= simple_format h idea.content.gsub(/\r\n?/, '\n') %>';
        ideaDiv.insertBefore(newP, formNode);
---
INSERT INTO `ideas` (`companydescription_id`, `content`, `created_at`, `first_name`, `idea_id`, `is_protected`, `last_name`, `startup_id`, `title`, `updated_at`, `user_id`) VALUES (86, 'sfdfsdf', '2013-06-08 19:03:18', 'Sergey', NULL, 0, 'Astretsov', 7, 'Prototype', '2013-06-08 19:03:18', 1)