app/views/startups/_dashboard_description.html.haml

        .idea-statement{:onclick => "voteThis(this)"}
          - old_description = Companydescription.find(description.companydescription_id)
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`id` = 150 LIMIT 1

          %hr.middle-hr.empty-comment
        - ideas.select{|x| x.id == x.idea_id}.each do |idea|
---
SELECT `ideas`.* FROM `ideas` WHERE (companydescription_id = 213 OR companydescription_id = 212 OR companydescription_id = 211 OR companydescription_id = 210 OR companydescription_id = 209 OR companydescription_id = 208 OR companydescription_id = 207 OR companydescription_id = 206 OR companydescription_id = 205 OR companydescription_id = 204 OR companydescription_id = 203 OR companydescription_id = 201 OR companydescription_id = 200 OR companydescription_id = 197 OR companydescription_id = 148 OR companydescription_id = 147 OR companydescription_id = 146 OR companydescription_id = 139 OR companydescription_id = 125)