app/views/startups/_description.html.haml

            if session[:id] != nil
              vote = Vote.where("user_id = ? and companydescription_id = ?", session[:id], description.id)
---
SELECT `votes`.* FROM `votes` WHERE (user_id = 2 and companydescription_id = 253)

        .idea-statement{:onclick => "voteThis(this)"}
          - old_description = Companydescription.find(description.companydescription_id)
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`id` = 150 LIMIT 1

          %hr.middle-hr.empty-comment
        - ideas.select{|x| x.id == x.idea_id}.each do |idea|
---
SELECT `ideas`.* FROM `ideas` WHERE (companydescription_id = 253 OR companydescription_id = 216 OR companydescription_id = 215 OR companydescription_id = 214 OR companydescription_id = 196 OR companydescription_id = 195 OR companydescription_id = 194 OR companydescription_id = 168 OR companydescription_id = 122)