app/views/startups/_lightning_company.html.erb

SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 9
---

  <% company_descriptions=startup.Companydescriptions.where('status = 1')[0..2].sort!{|x, y| x["allfield_id"] <=> y["allfield_id"]} %>