app/views/startups/_lightning_company.html.erb

        </div>
        <b><%= Allfield.find(description.allfield_id).field_name%></b>
---
SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1