app/views/startups/_startup.html.haml

    = simple_format startup.pitch.firstletters(110)
    - tags = @tags.select {|x| x.startup_id = startup.id}
---
SELECT `startups`.* FROM `startups` WHERE (status > 1)