app/views/startups/ab_testing.html.erb

            <div class="company-box">
                <h5><%= Allfield.find(description.allfield_id).field_name %>:
---
SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1

                    <div class="ab-test">
                        <% old_description = Companydescription.find(description.companydescription_id) %>
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (allfield_id =2 AND status =1)