app/views/startups/circles.html.haml

          - @circles.each do |person|
            %div= link_to(person.firstname + " " + person.lastname,
                                {:controller => "investors", :action => "follower_info",
                                :id => person.id, :action_type => "remove_circle"},
                                :remote => true)
---
SELECT `circles`.* FROM `circles` WHERE `circles`.`startup_id` = 7

        = hidden_field_tag :startup_id, @startup.id
        = select_tag :fund_id, options_from_collection_for_select(Fund.all, "id", "name"), {:include_blank => true}
---
SELECT `funds`.* FROM `funds` INNER JOIN `investors` ON `funds`.`id` = `investors`.`fund_id` WHERE `investors`.`startup_id` = 7