app/views/startups/dashboard.html.erb

                    <div class="idea-statement current-test">
                        <% old_description = Companydescription.find(description.companydescription_id) %>
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (status = 1)