app/views/startups/detailed.html.erb

SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 3 LIMIT 1
---
                  <div class="highlighted-company" id="div_<%= companydescription.id%>">
                    <h5 style="color:orange"><%= Allfield.find(companydescription.allfield_id).field_name %>:

SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (status = 1)
---
                          <div class="idea-statement current-test">
                            <%= simple_format Companydescription.find(companydescription.companydescription_id).content,
                                                                      :id => "p_"+ companydescription.id.to_s() %>