app/views/startups/show.html.erb

SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1
---
              <div class="company-box">
                  <h5><%= Allfield.find(description.allfield_id).field_name %>: