app/views/authentications/remote_login.js.erb


<% if @user.Owner_startups.length > 0 %>
---
SELECT COUNT(*) FROM `owners` WHERE `owners`.`user_id` = 1
SELECT `owners`.* FROM `owners` WHERE `owners`.`user_id` = 1