app/views/users/index.html.erb

              <% when 1 %>
                  <p>You were added to the team of <%= Startup.find(notification.event_id).name %> |
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1