app/views/users/notifications.html.haml

              %span.just-text You were added to the team of
              %span.author #{Startup.find(notification.event_id).name}
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 11 LIMIT 1

              =image_tag '/images/notification_request.png'
              %span.author #{User.find(notification.event_id/10000).firstname} #{User.find(notification.event_id/10000).lastname}
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

          %span.just-text commented on the
          %span.name #{Startup.find(idea.startup_id).name}:
---
SELECT `startups`.* FROM `startups` INNER JOIN `followers` ON `startups`.`id` = `followers`.`startup_id` WHERE `followers`.`user_id` = 1