app/views/tags/add_tag.js.erb

<% @tags.each do |tag| %>
var tagDiv = document.createElement("span");
---
INSERT INTO `tags` (`created_at`, `name`, `startup_id`, `updated_at`) VALUES ('2013-11-21 18:46:24', 'kjh', 7, '2013-11-21 18:46:24')