app/controllers/authentications_controller.rb

  def create

    @authentication = Authentication.new(params[:authentication])
    @authentication.make_username(params[:authentication][:username])

    user_errors = User.check_errors(params[:user])
    authentication_errors = Authentication.check_errors(params[:authentication])

    if user_errors == nil and authentication_errors == nil and @authentication.password == params[:ll][:password_confirmation]

      @authentication.make_hash(params[:authentication][:password])
      @user = @authentication.create_user(params[:user])

      startup_id = session[:startup_id]
      reset_session
      session[:startup_id] = startup_id

      respond_to do |format|
        if @authentication.save
          session[:id] = @user.id

          if params[:gotocontroller] == 'tri_valley_meetup'
            colleague = Colleague.new
            colleague.user_id = session[:id]
            colleague.fund_id = Fund.find_by_hashtag('trivalley').id
            colleague.status = 1
            colleague.save
          else
            UserMailer.send_welcome(params[:authentication][:username], @user.firstname).deliver
---
INSERT INTO `authentications` (`created_at`, `password`, `salt`, `status`, `updated_at`, `username`) VALUES ('2013-11-30 06:08:47', '14af5cc7f3cc2f4df2d47a0bd280ca969de83763', 'sTBoSySxrS', NULL, '2013-11-30 06:08:47', 'max@gardenexchange.com')
INSERT INTO `users` (`authentication_id`, `avatar`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `description`, `firstname`, `lastname`, `notification_num`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, '2013-11-30 06:08:47', NULL, 'Max', 'Smith', NULL, '2013-11-30 06:08:47')
UPDATE `users` SET `authentication_id` = 29, `updated_at` = '2013-11-30 06:08:47' WHERE `users`.`id` = 30
SELECT `authentications`.* FROM `authentications` WHERE (username = 'max@gardenexchange.com') LIMIT 1

  def remote_login
    if authentication = Authentication.authenticate(params[:authentication])
      session[:id] = authentication.user.id
      @user = User.find(session[:id])

      @notifications = @user.notifications.where("status = 1")
      @user.update_attributes(:notification_num => @notifications.length, :updated_at => Time.now)
---
SELECT `users`.* FROM `users` WHERE `users`.`authentication_id` = 1 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1 AND (status = 1)
UPDATE `users` SET `notification_num` = 0, `updated_at` = '2013-11-30 06:27:48' WHERE `users`.`id` = 30