app/controllers/campaigns_controller.rb

  def guide_step
    if session[:id] != nil and session[:id] != 0
      @startup = User.find(session[:id]).Owner_startups.first
---
SELECT `owners`.* FROM `owners` WHERE `owners`.`user_id` = 2

  def basic_step
     if session[:startup_id] != nil
       @startup = Startup.find(session[:startup_id])
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1

  def create_step

    params[:campaign][:closing_date] = Date.today
    params[:startup][:status] = 1

    if session[:startup_id] == nil
      @startup = Startup.new(params[:startup])
      if params[:is] != nil and params[:is][:campaign]=="1"
        @campaign = @startup.create_Campaign(params[:campaign])
        @campaign.raised_sum = 0
        @campaign.status = 1
        @campaign.valuation_sum = get_valuation(@campaign.goal_sum,@campaign.share)
      end
    else
      @startup = Startup.find(session[:startup_id])
---
SELECT `campaigns`.* FROM `campaigns` WHERE `campaigns`.`startup_id` = 7 LIMIT 1

          end
        else
          respond_to do |format|
            if @startup.update_attributes(params[:startup]) and @campaign.update_attributes(params[:campaign])
---
UPDATE `campaigns` SET `closing_date` = '2013-06-10 07:00:00', `updated_at` = '2013-06-10 19:32:27' WHERE `campaigns`.`id` = 8

  def review_step
    @startup =Startup.find(session[:startup_id])
    @campaign = @startup.Campaign

    i=0
    for allfield in Allfield.find_all_by_view_flag(3)
      i = i +1
      case i
        when 1
          @company_description_1 = @startup.Companydescriptions.find_by_allfield_id(allfield.id)
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`view_flag` = 3
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND `companydescriptions`.`allfield_id` = 2 LIMIT 1