app/controllers/campaigns_controller.rb

SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1
---
  def about_step
    @startup = Startup.find(session[:startup_id])

    # Works only for 3 fields!

    i=0
    for allfield in Allfield.find_all_by_view_flag(3)
      i = i +1
      case i
        when 1
          @companydescriptions1 = @startup.Companydescriptions.where("allfield_id = ? AND status = 1",allfield.id)[0]
          if @companydescriptions1 == nil
            @companydescriptions1 = Companydescription.new
            @companydescriptions1.allfield_id = allfield.id
          end
        when 2
          @companydescriptions2 = @startup.Companydescriptions.where("allfield_id = ? AND status = 1",allfield.id)[0]