app/controllers/campaigns_controller.rb

  def guide_step
    @user = User.find(session[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1

  def basic_step
     @startup = Startup.new
     @user = User.find(session[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1

  def create_step

    if params[:id] == nil
      params[:startup][:status] = 0
      @startup = Startup.new(params[:startup])
    else
      @startup = Startup.find(params[:id])
    end

    startup_errors = Startup.check_errors(params[:startup])

    if startup_errors != nil
      @startup.errors.add startup_errors.partition("/")[0]  , startup_errors.partition("/")[2]
      respond_to  do |format|
        format.html { render "basic_step" }
      end
    else
      if params[:id] == nil
        respond_to do |format|
          if @startup.save
            owner = Owner.new
            owner.startup_id = @startup.id
            owner.user_id = session[:id]
            owner.status = 1
            owner.save
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
INSERT INTO `startups` (`avatar`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `link`, `name`, `pitch`, `status`, `updated_at`, `votes`) VALUES (NULL, NULL, NULL, NULL, NULL, '2013-11-30 06:11:52', 'www.gardenexchange.com', 'Garden Exchnage', 'A social network where people can exchange their home plants as well as learn how to take care of them. This is a Facebook application and we are reaching out to customers only using social media presents.', 0, '2013-11-30 06:11:52', NULL)
UPDATE `startups` SET `name` = 'whatis', `updated_at` = '2013-06-10 23:56:51' WHERE `startups`.`id` = 7
INSERT INTO `owners` (`created_at`, `role`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-11-30 06:11:52', NULL, 33, 1, '2013-11-30 06:11:52', 30)

  def about_step

    @startup = Startup.find(params[:id])
    @user = User.find(session[:id])
    all_descriptions = @startup.companydescriptions.where("status = 1")
    @descriptions = Array.new

    Allfield.where("view_flag = 3").each do |all_field|
      if all_descriptions.select{|x| x.allfield_id == all_field.id}.length > 0
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (allfield_id = 2 AND status = 1)
SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`view_flag` = 3
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND `companydescriptions`.`allfield_id` = 2 LIMIT 1

  def description_step

    #Works only for 3 fields!

    startup = Startup.find(params[:id])
    all_descriptions = startup.companydescriptions.where("status = 1")
    no_errors = 1

    params_descriptions = Array.new

    params_description = Companydescription.new
    params_description.allfield_id = params[:companydescriptions1][:allfield_id]
    params_description.content = params[:companydescriptions1][:content]
    params_description.field_status = params[:companydescriptions1][:field_status]
    params_descriptions << params_description

    params_description = Companydescription.new
    params_description.allfield_id = params[:companydescriptions2][:allfield_id]
    params_description.content = params[:companydescriptions2][:content]
    params_description.field_status = params[:companydescriptions2][:field_status]
    params_descriptions << params_description

    params_description = Companydescription.new
    params_description.allfield_id = params[:companydescriptions3][:allfield_id]
    params_description.content = params[:companydescriptions3][:content]
    params_description.field_status = params[:companydescriptions3][:field_status]
    params_descriptions << params_description

    params_descriptions.each do |params_description|
      descriptions = all_descriptions.select {|a| a.allfield_id == params_description.allfield_id }
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (allfield_id = '2' AND status = 1)
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND `companydescriptions`.`allfield_id` = 2 LIMIT 1

        description.startup_id = params[:id]
        description.status = 1
        description.companydescription_id = description_id
        no_errors = 0 if !description.save
---
INSERT INTO `companydescriptions` (`allfield_id`, `approval_status`, `companydescription_id`, `content`, `created_at`, `field_status`, `startup_id`, `status`, `updated_at`) VALUES (2, NULL, NULL, 'People love to travel abroad, but for many people traveling is always associated with a concern of taking care of their plants. If you have to go away for three weeks, who would take care and water your \'babies\'. ', '2013-11-30 06:20:51', 'Problem', 33, 1, '2013-11-30 06:20:51')
UPDATE `companydescriptions` SET `field_status` = 'Problem', `updated_at` = '2013-06-10 20:12:12' WHERE `companydescriptions`.`id` = 6


    respond_to do |format|
      if no_errors == 1
        startup.update_attributes :status => 1
---
UPDATE `startups` SET `status` = 1, `updated_at` = '2013-11-30 06:20:51' WHERE `startups`.`id` = 33

  def circles_step
    @user = User.find(session[:id])
    @startup = Startup.find(params[:id])
    @tags = @startup.tags
    @people = User.all[0..5]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
SELECT `users`.* FROM `users`

  def publish_step
    startup = Startup.find(params[:id])
    startup.update_attributes :status => 2
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
UPDATE `startups` SET `status` = 2, `updated_at` = '2013-11-30 06:21:30' WHERE `startups`.`id` = 33

  def update_description
    startup = Startup.find(params[:id])
    startup.update_attributes :pitch => params[:pitch] if params[:pitch] and params[:pitch].length > 0
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
UPDATE `startups` SET `pitch` = 'Alumni crowdfunding platform. We help entrepreneurs raise money from thier alma mater network??\r\n', `updated_at` = '2013-06-09 19:39:09' WHERE `startups`.`id` = 7

  def update_name
    startup = Startup.find(params[:id])
    startup.update_attributes :name => params[:name] if params[:name] and params[:name].length > 0
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
UPDATE `startups` SET `name` = 'Garden Exchange', `updated_at` = '2013-12-02 19:25:57' WHERE `startups`.`id` = 33

  def upload_logo
    @startup = Startup.find(params[:id])
    if @startup.update_attributes :avatar => params[:avatar]
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
UPDATE `startups` SET `avatar_file_name` = 'th.jpeg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 139726, `avatar_updated_at` = '2013-12-02 21:52:48', `updated_at` = '2013-12-02 21:52:51' WHERE `startups`.`id` = 33