app/controllers/circles_controller.rb

  def add_circle
    startup = Startup.find(params[:startup_id])
    respond_to do |format|
      case params[:circle_status]
        when "0"
          circles = startup.circles
          circles.destroy_all
          @people = startup.circle_users[0..39]
          format.js {render "hide_people"}

        when "1"
          circles = startup.circles.where("status > 2")
          circles.destroy_all
          @people = startup.circle_users[0..39]
          format.js

        when "2"
          circles = startup.circles.where("status > 1")
          circles.destroy_all
          User.all.sample(20).each do |user|
            circle = Circle.new
            circle.startup_id = startup.id
            circle.user_id = user.id
            circle.status = 2
            circle.save
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 16 LIMIT 1
DELETE FROM `circles` WHERE `circles`.`id` = 263
SELECT `circles`.* FROM `circles` WHERE `circles`.`startup_id` = 16 AND (status > 2)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users`
INSERT INTO `circles` (`created_at`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-11-21 17:52:26', 7, 2, '2013-11-21 17:52:26', 3)

  def add_person
    startup = Startup.find(params[:startup_id])
    return if !params[:user_id]

    if User.find(params[:user_id]) and circle = startup.circles.where("user_id = ?",params[:user_id]).length == 0
      circle = Circle.new
      circle.startup_id = params[:startup_id]
      circle.user_id = params[:user_id]
      circle.status = 1
      circle.save
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 16 LIMIT 1
SELECT `circles`.* FROM `circles` WHERE `circles`.`startup_id` = 16 AND (user_id = '3')
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `circles` (`created_at`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-11-21 17:51:49', 16, 1, '2013-11-21 17:51:49', 3)

  def remove_person

    return if !params[:user_id]

    startup = Startup.find(params[:startup_id])
    circle = startup.circles.where("user_id = ?",params[:user_id])
    circle.destroy_all if circle.length > 0
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `circles`.* FROM `circles` WHERE `circles`.`user_id` = 17 LIMIT 1
DELETE FROM `circles` WHERE `circles`.`id` = 660

  def send_access_request

    return if params[:startup_id].nil?
    startup = Startup.find(params[:startup_id])
    return if startup.nil?

    if startup.circles.where("user_id = ?", session[:id]).length == 0
      circle = Circle.new
      circle.startup_id = params[:startup_id]
      circle.user_id = session[:id]
      circle.status = 3 # 3 - request
      circle.save

      if Notification.where("event_type = 3 AND user_id = ? AND event_id = ? AND status = 1", session[:id], (params[:startup_id].to_i + 10000 * session[:id])).length == 0
        notification  = Notification.new
        notification.event_id = (params[:startup_id].to_i + 10000 * session[:id])
        notification.user_id = Owner.where("startup_id = ? AND status = 1", params[:startup_id])[0].user_id
        notification.status = 1
        notification.event_type = 3
        notification.save
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 27 LIMIT 1
SELECT `circles`.* FROM `circles` WHERE `circles`.`startup_id` = 27 AND (user_id = 2)
INSERT INTO `circles` (`created_at`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-12-04 00:21:43', 27, 3, '2013-12-04 00:21:43', 2)
SELECT `notifications`.* FROM `notifications` WHERE (event_type = 3 AND user_id = 2 AND event_id = '27' AND status = 1)
SELECT `owners`.* FROM `owners` WHERE (startup_id = '27' AND status = 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `notifications` (`created_at`, `event_id`, `event_type`, `status`, `updated_at`, `user_id`) VALUES ('2013-12-04 00:37:47', 20027, 3, 1, '2013-12-04 00:37:47', 78)

  def confirm_request

    circles = Circle.where("user_id = ? AND startup_id = ? AND status = 3", params[:user_id], params[:startup_id])

    return if circles.length == 0

    circles.each do |circle|
      circle.update_attribute(:status, 4)
    end

    notifications = Notification.where("event_type = 3 AND user_id = ? AND event_id = ? AND status = 1", session[:id], (params[:startup_id].to_i + 10000 * params[:user_id].to_i))
    notifications.each do |notification|
      notification.update_attribute(:status, 0)
    end

    if Notification.where("event_type = 4 AND user_id = ? AND event_id = ? AND status = 1", params[:user_id], params[:startup_id]).length == 0
      notification  = Notification.new
      notification.event_id = params[:startup_id]
      notification.user_id = params[:user_id]
      notification.status = 1
      notification.event_type = 4
      notification.save
---
SELECT `circles`.* FROM `circles` WHERE (user_id = 1 AND startup_id = '27' AND status = 3)
UPDATE `circles` SET `status` = 4, `updated_at` = '2013-12-04 01:35:27' WHERE `circles`.`id` = 1687
SELECT `notifications`.* FROM `notifications` WHERE (event_type = 3 AND user_id = 1 AND event_id = 20027 AND status = 1)
UPDATE `notifications` SET `status` = 0, `updated_at` = '2013-12-04 01:39:00' WHERE `notifications`.`id` = 94
INSERT INTO `notifications` (`created_at`, `event_id`, `event_type`, `status`, `updated_at`, `user_id`) VALUES ('2013-12-04 01:39:00', 27, 4, 1, '2013-12-04 01:39:00', 2)