app/controllers/circles_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def remove_person
    startup = Startup.find(session[:startup_id])
    if !params[:user_id]
      return
    end
    circle = Circle.find_by_user_id(params[:user_id])
    if circle and User.find(params[:user_id])