app/controllers/companydescriptions_controller.rb

  def new_suggestion

    if params[:change_type] == "1"

      old_description = Companydescription.find(params[:companydescription][:companydescription_id])
      @description = Companydescription.new(params[:companydescription])
      @description.startup_id = old_description.startup_id
      @description.allfield_id = old_description.allfield_id
      @description.field_status = old_description.field_status
      @description.status = 1

      respond_to do |format|
        if @description.save
          old_description.update_attribute(:status, 0)
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`id` = 259 LIMIT 1
INSERT INTO `companydescriptions` (`allfield_id`, `approval_status`, `companydescription_id`, `content`, `created_at`, `field_status`, `startup_id`, `status`, `updated_at`) VALUES (2, NULL, 259, 'Plant lovers have many similar plants at their homes, because they just grow too fast. Like Sergey, who has just two types of plant at his home, but it still takes more than 50% of the whole space. It\'s too sad to just thru them away and it\'s too hard to keep them within their space.', '2013-11-30 06:34:41', 'Problem', 33, 1, '2013-11-30 06:34:41')
UPDATE `companydescriptions` SET `content` = 'Plant lovers have many similar plants at their homes, because they just grow too fast. Like Sergey, who has just two types of plant at his home, but it still takes more than 50% of the whole space. It\'s too sad to just threw them away and it\'s too hard to keep them within their space.', `updated_at` = '2013-12-01 19:29:02' WHERE `companydescriptions`.`id` = 262

  def update_description
    @companydescription = Companydescription.find(params[:description][:id])
    @companydescription.update_attributes(params[:description])
---
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`id` = 86 LIMIT 1
UPDATE `companydescriptions` SET `field_status` = 'Problem', `content` = 'let me just update it', `updated_at` = '2013-06-08 19:49:03' WHERE `companydescriptions`.`id` = 86