app/controllers/funds_controller.rb

SELECT `funds`.* FROM `funds`
---
  def index
    @funds = Fund.all

SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 LIMIT 1
---
  def show
    @fund = Fund.find(params[:id])

SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 2 LIMIT 1
---
  def edit
    @fund = Fund.find(params[:id])

INSERT INTO `funds` (`created_at`, `hashtag`, `name`, `status`, `updated_at`) VALUES ('2013-11-23 06:29:08', 'firstsolar', 'First Solar', NULL, '2013-11-23 06:29:08')
---
  def create
    @fund = Fund.new(params[:fund])

    respond_to do |format|
      if @fund.save

SELECT `funds`.* FROM `funds` WHERE `funds`.`id` = 1 LIMIT 1
UPDATE `funds` SET `hashtag` = 'igate', `updated_at` = '2013-11-23 00:36:00' WHERE `funds`.`id` = 1
---
  def update
    @fund = Fund.find(params[:id])

    respond_to do |format|
      if @fund.update_attributes(params[:fund])