app/controllers/home_controller.rb

SELECT `startups`.* FROM `startups` WHERE (status >2)
SELECT `tags`.* FROM `tags`
---
  def index
    startups = Startup.where("status >2").all
    @startups = startups.sample(3)
    @tags = Tag.all

SELECT `startups`.* FROM `startups` WHERE (status >2)
SELECT `tags`.* FROM `tags`
---
  def signup
    startups = Startup.where("status >2").all
    @startups = startups.sample(3)
    @tags = Tag.all

SELECT `startups`.* FROM `startups` WHERE (status >2)
---
  def colorful
    startups = Startup.where("status >2").all