app/controllers/ideas_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `ideas` (`companydescription_id`, `content`, `created_at`, `first_name`, `idea_id`, `is_protected`, `last_name`, `startup_id`, `title`, `updated_at`, `user_id`) VALUES (82, 'jhgk,hg', '2013-11-21 19:23:48', 'Sergey', NULL, 0, 'Astretsov', 11, 'Prototype', '2013-11-21 19:23:48', 1)
---
  def create

    idea = Idea.new(params[:idea])


    if params[:idea][:content] == ""
      flash[:error] = "No message"
      return
    end


    if !session[:id] or session[:id] == 0
      flash[:error] = "PLease login first"
      return
    end

    user = User.find(session[:id])

    return if !user


    idea.last_name = user.lastname
    idea.first_name = user.firstname
    idea.user_id = user.id


    respond_to do |format|
      if idea.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 9 LIMIT 1
SELECT `owners`.* FROM `owners` WHERE `owners`.`user_id` = 1
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`startup_id` = 9
---
  def idea_test
    @user = User.find(session[:id]) if session[:id] and session[:id] != 0
    session[:startup_id]= params[:id]
    @startup = Startup.find(params[:id])
    @startup_investors = @startup.Investor_users.all.uniq
    @startup_followers = @startup.Follower_users.all.uniq
    @startup_owners = @startup.Owner_users.all.uniq

    if session[:id] == nil || session[:id]== 0
      @reader_type = 0
    else
      if @startup_owners.first.id == session[:id]
        @reader_type = 3
      else
        if !@startup_followers.detect{|w| w.id == session[:id]}
          @reader_type = 2
        else
          @reader_type = 1
        end
      end
    end


    @ideas = @startup.Ideas.all