app/controllers/investors_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 8 LIMIT 1
INSERT INTO `followers` (`created_at`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-06-09 21:22:26', 8, 1, '2013-06-09 21:22:26', 2)
---
  def followcompany

    @user = User.find(session[:id])
    @startup = Startup.find(session[:startup_id])

    if session[:id]==nil || session[:id]==0
      redirect_to :controller => 'users', :action => 'login_join'
    #else
    # if @startup.Investor_users.all.include? @user
    #  @investor=@startup.Investors.find_by_user_id(session[:id])
    else
      @follower = Follower.new
      @follower.startup_id = @startup.id
      @follower.user_id = session[:id]
      @follower.status = 1

    end

    if @follower.save