app/controllers/investors_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 33 LIMIT 1
SELECT `followers`.* FROM `followers` WHERE (startup_id = '33' AND user_id =1)
INSERT INTO `followers` (`created_at`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-11-30 06:23:17', 33, 1, '2013-11-30 06:23:17', 1)
---
  def follow_company

    user = User.find(session[:id])
    startup = Startup.find(session[:startup_id])

    if !user || !startup
      return
    end

    respond_to do |format|
      if !params[:unfollow] or (params[:unfollow] != 1 and params[:unfollow] != "1")
        follower = Follower.where('startup_id = ? AND user_id =?', session[:startup_id], session[:id])[0]
        if !follower
          follower = Follower.new
          follower.startup_id = session[:startup_id]
          follower.user_id = session[:id]
          follower.status = 1
          follower.save

SELECT `users`.* FROM `users` WHERE ((UPPER(firstname) LIKE UPPER('%a%') and UPPER(lastname) LIKE UPPER('%%')) or (UPPER(firstname) LIKE UPPER('%%') and UPPER(lastname) LIKE UPPER('%a%')))
---
  def search_people
    if !params[:string] || params[:string] == ""
      @people = User.all[0..5]

SELECT `owners`.* FROM `owners` WHERE `owners`.`user_id` = 2 AND `owners`.`startup_id` = 7 LIMIT 1
INSERT INTO `owners` (`created_at`, `role`, `startup_id`, `status`, `updated_at`, `user_id`) VALUES ('2013-06-02 00:24:53', NULL, 7, 2, '2013-06-02 00:24:53', 2)
SELECT `notifications`.* FROM `notifications` WHERE (event_id = '7' AND user_id = '2' AND status > 0 AND (event_type =1 OR event_type =2))
INSERT INTO `notifications` (`created_at`, `event_id`, `event_type`, `status`, `updated_at`, `user_id`) VALUES ('2013-06-02 00:24:53', 7, 1, 1, '2013-06-02 00:24:53', 2)
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
---
  def add_founder

    if !params[:founder_id] || params[:founder_id] == 0
     return
    end

    if User.find(params[:founder_id]) and !Owner.find_by_user_id_and_startup_id(params[:founder_id], session[:startup_id])
      owner = Owner.new
      owner.startup_id = session[:startup_id]
      owner.user_id = params[:founder_id]
      owner.status = 2
      owner.save


      notifications = Notification.where("event_id = ? AND user_id = ? AND status > ? AND (event_type =? OR event_type =?)",
                                         session[:startup_id], params[:founder_id], 0, 1, 2).all

      notifications.each do |notification|
        notification.update_attribute(:status, 0)
      end

      notification  = Notification.new
      notification.event_id = session[:startup_id]
      notification.user_id = params[:founder_id]
      notification.status = 1
      notification.event_type = 1
      notification.save
    end

    respond_to do |format|
        startup = Startup.find(session[:startup_id])

SELECT `owners`.* FROM `owners` WHERE `owners`.`user_id` = 1 AND `owners`.`startup_id` = 7 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE (event_id = '8' AND user_id = '1' AND status > 0 AND (event_type =1 OR event_type =2))
INSERT INTO `notifications` (`created_at`, `event_id`, `event_type`, `status`, `updated_at`, `user_id`) VALUES ('2013-12-05 03:56:10', 8, 2, 1, '2013-12-05 03:56:10', 1)
DELETE FROM `owners` WHERE `owners`.`id` = 105
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
---
  def remove_founder

    owner = Owner.find_by_user_id_and_startup_id(params[:founder_id], session[:startup_id])

    if !owner
      return
    end


    respond_to do |format|
      if owner.status == 1
        format.js
      else

        notifications = Notification.where("event_id = ? AND user_id = ? AND status > ? AND (event_type =? OR event_type =?)",
                                           session[:startup_id], params[:founder_id], 0, 1, 2).all

        notifications.each do |notification|
          notification.update_attribute(:status, 0)
        end

        notification = Notification.new
        notification.event_id = session[:startup_id]
        notification.user_id = params[:founder_id]
        notification.status = 1
        notification.event_type = 2
        notification.save

        owner.destroy
        startup = Startup.find(session[:startup_id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def follower_info

    @follower = User.find(params[:id])