app/controllers/notifications_controller.rb

  def check_notification
    user = User.find(session[:id])

    if user
      notifications = Notification.where("user_id = ? AND status = 1", user.id)
      if notifications
        total_notifications = notifications.length
        notification = Notification.find(params[:id])
        if notification
          notification.update_attribute(:status, 0)
          user.update_attribute(:notification_num, total_notifications-1)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`id` = 95 LIMIT 1
UPDATE `notifications` SET `status` = 0, `updated_at` = '2013-12-04 16:45:01' WHERE `notifications`.`id` = 95
UPDATE `users` SET `notification_num` = 0, `updated_at` = '2013-12-04 16:45:01' WHERE `users`.`id` = 2