app/controllers/startups_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 8 LIMIT 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 8 AND (allfield_id =2 AND status =1)
---
  def ab_testing
    @user = User.find(session[:id]) if session[:id] and session[:id] != 0
    @startup = Startup.find(params[:id])

    i=0
    @company_descriptions = @startup.Companydescriptions.where("status =?", 1)