app/controllers/startups_controller.rb

  def index
    @user = User.find(session[:id])  if session[:id] and session[:id] != 0
    @startups = Startup.where("status > 1").all
    @startups.sort! {|y, x| x["status"] <=> y["status"]}
    @startups = @startups.sample(16)
    @startups_shown = 16

    tags = Tag.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE (status > 1)
SELECT `tags`.* FROM `tags` WHERE `tags`.`startup_id` = 7

  def my_ideas

    if !session[:id] || session[:id] == 0
      redirect_to :action => "index" and return
    end

    @user = User.find(session[:id])

    @startups = @user.Owner_startups

    tags = Tag.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `tags`.* FROM `tags`

  def following_ideas

    if !session[:id] || session[:id] == 0
      redirect_to :action => "index" and return
    end

    @user = User.find(session[:id])

    @startups = @user.Follower_startups

    tags = Tag.all
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `tags`.* FROM `tags`

  def show
    @user = User.find(session[:id]) if session[:id] and session[:id] != 0
    @startup = Startup.find(params[:id])
    @startup_followers = @startup.Follower_users.all.uniq
    @startup_owners = @startup.Owner_users.all.uniq
    @startup_updates = @startup.Companyupdates
    @companyupdate = Companyupdate.new

    @company_descriptions = @startup.Companydescriptions.where("status =?", 1).sort!{|x, y| x["allfield_id"] <=> y["allfield_id"]}
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `followers`.* FROM `followers` WHERE (startup_id = '32' AND user_id = 1)
SELECT `owners`.* FROM `owners` WHERE (startup_id = '19' AND user_id = 1)
SELECT COUNT(*) FROM `companyupdates` WHERE `companyupdates`.`startup_id` = 9
SELECT COUNT(*) FROM `owners` WHERE `owners`.`user_id` = 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 9 AND (allfield_id =2 AND status =1)
SELECT `companyupdates`.* FROM `companyupdates` WHERE `companyupdates`.`startup_id` = 9

  def circle
    @startup = Startup.find(session[:startup_id])
    @tags = @startup.Tags
    @people = User.all[0..5]
    @circles = @startup.Circle_users[0..39]
    @startup_owners = @startup.Owner_users.all.uniq
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `users`.* FROM `users`
SELECT `owners`.* FROM `owners` WHERE (startup_id = '7' AND user_id = 1)
SELECT `tags`.* FROM `tags` WHERE `tags`.`startup_id` = 7
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def dashboard
    @user = User.find(session[:id])   if session[:id] and session[:id] != 0
    @startup = Startup.find(params[:id])
    @descriptions = @startup.Companydescriptions.where("status = ?",1).sort!{|x, y| x["allfield_id"] <=> y["allfield_id"]}
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (status = 1)

  def detailed
    @user = User.find(session[:id])   if session[:id] and session[:id] != 0
    @startup = Startup.find(session[:startup_id])
    @descriptions = @startup.Companydescriptions.where("status = ?",1)
    @startup_followers = @startup.Follower_users.all.uniq
    @startup_owners = @startup.Owner_users.all.uniq
    @companyupdate = Companyupdate.new
    @company_descriptions = @startup.Companydescriptions.where("status =?", 1).sort!{|x, y| x["allfield_id"] <=> y["allfield_id"]}
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `companydescriptions`.* FROM `companydescriptions` WHERE `companydescriptions`.`startup_id` = 7 AND (status = 1)
SELECT `owners`.* FROM `owners` WHERE (startup_id = '7' AND user_id = 1)
SELECT COUNT(*) FROM `owners` WHERE `owners`.`user_id` = 1

  def team
    @startup = Startup.find(session[:startup_id])
    @startup_owners = @startup.Owner_users.all.uniq
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `owners`.* FROM `owners` WHERE (startup_id = '7' AND user_id = 1)
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def search_startups
    if !params[:string] || params[:string] == ""
      @startups = Startup.all.sample(9)
---
SELECT `startups`.* FROM `startups` WHERE (UPPER(name) LIKE UPPER('%s%') OR id = 13 OR id = 7 OR id = 16 OR id = 12 OR id = 7 OR id = 31 OR id = 8 OR id = 16 OR id = 12)

  def show_more_startups

    add_startups = 6
    startup_list = params[:startup_list].split(",")
    @startups_shown = startup_list.length + add_startups
    @startups = Startup.where("status > 1").select {|x| !startup_list.include?(x.id.to_s()) }
---
SELECT `startups`.* FROM `startups` WHERE (status > 1)

  def vote_lightning

    if !params[:id0] || params[:id0] == 0 || !params[:id1] || params[:id1] == 0 || !params[:id2] || params[:id2] == 0
      redirect_to :action => "vote_next", :id0 => params[:id0], :id1 => params[:id1],:id2 => params[:id2] and return
    else
      if params[:id0] == params[:id1] || params[:id1] == params[:id2] || params[:id2] == params[:id0]
        redirect_to :action => "vote_next", :id0 => params[:id0], :id1 => params[:id1],:id2 => params[:id2] and return
      end
    end

    @startups = Array.new
    @startups[0]=Startup.find(params[:id0])
---
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 9 LIMIT 1

  def vote_next

    all_startups = Startup.where("status >= 2").all
    not_used_startups = Array.new

    if !session[:id].nil? and session[:id] != 0
      voted_descriptions = Vote.where("user_id = ?", session[:id])
      voted_descriptions.uniq! {|p| p.startup_id}
      all_startups.each do |startup|
---
SELECT `startups`.* FROM `startups`