app/controllers/tags_controller.rb

SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`startup_id` = 7 AND `tags`.`name` = 'kjh' LIMIT 1
INSERT INTO `tags` (`created_at`, `name`, `startup_id`, `updated_at`) VALUES ('2013-11-21 18:46:24', 'kjh', 7, '2013-11-21 18:46:24')
---
  def add_tag
    startup = Startup.find(session[:startup_id])
    if params[:tag_name] and params[:tag_name].length.between?(1, 40)
      text = params[:tag_name].downcase.split.join('')
      tag = startup.Tags.find_by_name(text)
      if !tag
        tag = Tag.new
        tag.name = text
        tag.startup_id = startup.id
        tag.save

SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 7 LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`startup_id` = 7 AND `tags`.`id` = 117 LIMIT 1
DELETE FROM `tags` WHERE `tags`.`id` = 117
---
  def delete_tag
    startup = Startup.find(session[:startup_id])
    if params[:tag_id]
      tag = startup.Tags.find(params[:tag_id])
      tag.destroy