app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`user_id` = 1 AND (status = 1)
UPDATE `users` SET `notification_num` = 1, `updated_at` = '2013-12-04 00:50:09' WHERE `users`.`id` = 1
SELECT `ideas`.* FROM `ideas` WHERE (startup_id = 7 OR startup_id = 12 OR startup_id = 13 OR startup_id = 14 OR startup_id = 15 OR startup_id = 16 OR startup_id = 17 OR startup_id = 18 OR startup_id = 19 OR startup_id = 21 OR startup_id = 22 OR startup_id = 23 OR startup_id = 24 OR startup_id = 25 OR startup_id = 26 OR startup_id = 27 OR startup_id = 28 OR startup_id = 29 OR startup_id = 30 OR startup_id = 31 OR startup_id = 10 OR startup_id = 8 OR startup_id = 11 OR startup_id = 33)
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 11 LIMIT 1
---
  def notifications

    @user = User.find(params[:id])
    @notifications = @user.Notifications.where("status = 1")
    #@notifications.uniq! {|a| a.event_type and a.event_id}
    @notifications.sort! {|y, x| x["created_at"] <=> y["created_at"]}

    @user.update_attribute(:notification_num, @notifications.length) if @notifications.length != @user.notification_num

    #@user_updates = Array.new
    #@user_startups.each do |startup|
    #  @user_updates << startup.Companyupdates
    #end
    #if @user_updates != nil
    #  @user_updates.sort! { |y, x| x["newsdate"] <=> y["newsdate"] }
    #end

    ideas = Idea.where("user_id = ?", session[:id])

    startups_id = Array.new

    @user.Owner_startups.each do |startup|

SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1
---
  def edit
    @user = User.find(session[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 30 LIMIT 1
UPDATE `users` SET `avatar_file_name` = 'photo.jpg', `avatar_content_type` = 'image/jpeg', `avatar_file_size` = 240375, `avatar_updated_at` = '2013-12-01 20:13:34', `updated_at` = '2013-12-01 20:13:37' WHERE `users`.`id` = 30
---
  def update
    @user = User.find(session[:id])
    if @user.update_attributes(params[:user])