app/controllers/votes_controller.rb

SELECT `votes`.* FROM `votes` WHERE (user_id = 1 AND startup_id ='32')
SELECT `votes`.* FROM `votes` WHERE `votes`.`user_id` IS NULL AND `votes`.`companydescription_id` = 8 LIMIT 1
INSERT INTO `votes` (`companydescription_id`, `created_at`, `score`, `startup_id`, `updated_at`, `user_id`) VALUES (256, '2013-11-23 06:19:59', 4, 32, '2013-11-23 06:19:59', 1)
SELECT `startups`.* FROM `startups` WHERE `startups`.`id` = 32 LIMIT 1
UPDATE `startups` SET `votes` = 1, `updated_at` = '2013-11-23 06:19:59' WHERE `startups`.`id` = 32
UPDATE `votes` SET `score` = -1, `updated_at` = '2013-06-05 21:44:58' WHERE `votes`.`id` = 143
---
  def vote_description

    startup_votes = Vote.where("user_id = ? AND startup_id =?", session[:id], params[:startup_id])

    if startup_votes.length == 0
      is_voted = 0
    else
      vote = startup_votes.select{|x| x.companydescription_id.to_s == params[:vote][:description_id]}
      if !vote.nil? and vote.length > 0
        is_voted = 1
      else
        is_voted = 0
      end
    end

    if is_voted == 0
      vote = Vote.new
      vote.companydescription_id = params[:vote][:description_id]
      vote.startup_id = params[:startup_id]
      vote.user_id = session[:id]
      vote.score = params[:vote][:score]
      vote.save
      if startup_votes.length == 0
        startup = Startup.find(params[:startup_id])
        startup.votes = 0 if startup.votes.nil?
        startup.update_attribute(:votes, startup.votes + 1)

SELECT `votes`.* FROM `votes` WHERE (companydescription_id = '259')
---
  def show_votes
    @votes = Vote.where("companydescription_id = ?",params[:description_id]).all