app/views/campaigns/about_step.html.erb

SELECT `allfields`.* FROM `allfields` WHERE `allfields`.`id` = 2 LIMIT 1
---
            <li>
              <% allfield =  Allfield.find(@companydescriptions1.allfield_id)   %>