app/views/votes/show_votes.js.erb

SELECT `votes`.* FROM `votes` WHERE (companydescription_id = '259')
---

// Create and populate the data table.
var data = google.visualization.arrayToDataTable([
    ['Vote', 'Number of votes'],
    ['0',  <%= @votes.count { |x| x.score == 0 }%>],
    ['1',  <%= @votes.count { |x| x.score == 1 }%>],
    ['2',  <%= @votes.count { |x| x.score == 2 }%>],
    ['3',  <%= @votes.count { |x| x.score == 3 }%>],
    ['4',  <%= @votes.count { |x| x.score == 4 }%>],
    ['5',  <%= @votes.count { |x| x.score == 5 }%>]
]);